Show / Hide Table of Contents
Class ReinfBarOnMoreEdges
Representing reinforcement bar input on more edges in IDEA StatiCa Detail
Inheritance
System.Object
OpenObject
OpenElementId
Reinforcement
ReinforcementGroup
ReinfBarOnMoreEdges
Inherited Members
 ReinforcementGroup.Diameter
 ReinforcementGroup.NumOfBarsInLayer
 ReinforcementGroup.CoverFromSetting
 ReinforcementGroup.Cover
 ReinforcementGroup.EndsTypeBeg
 ReinforcementGroup.EndsTypeEnd
 ReinforcementGroup.DiameterOfMandrel
 Reinforcement.ReinfId
 Reinforcement.Material
 OpenElementId.Id
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
[OpenModelClass(typeof(Reinforcement))]
public class ReinfBarOnMoreEdges : ReinforcementGroup
Constructors
Improve this Doc   View Source
ReinfBarOnMoreEdges()
Constructor
Declaration
public ReinfBarOnMoreEdges()
Properties
Improve this Doc   View Source
Covers
Covers
Declaration
public List<double> Covers { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<System.Double>
Improve this Doc   View Source
LengthFromFirstIntersection
Length of bar from first intersection in the direction of edge
Declaration
public double LengthFromFirstIntersection { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
LengthFromLastIntersection
Length of bar from last intersection in the direction of edge
Declaration
public double LengthFromLastIntersection { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
MasterComponent
Master component of reinforcement
Declaration
public ReferenceElement MasterComponent { get; set; }
Property Value
 Type |  Description
 ReferenceElement
Improve this Doc   View Source
MasterEdges
Master Edges
Declaration
public List<ReferenceElement> MasterEdges { get; set; }
Property Value
 Type |  Description
 System.Collections.Generic.List<ReferenceElement>
Improve this Doc   View Source
WholeFirstEdge
Bar is on whole length of first edge
Declaration
public bool WholeFirstEdge { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
WholeLastEdge
Bar is on whole length of last edge
Declaration
public bool WholeLastEdge { get; set; }
Property Value
 Type |  Description
 System.Boolean
 Improve this Doc
 View Source